ORI_HR_FIORIINBOX_to_SFSF_TodoList/bin/log/AFmePVdy1KTHVUiBz7LJhZJ1xMCZ/CallActivity_1-6.body

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cxf="http://cxf.component.camel.apache.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <cxf:invoke>?</cxf:invoke>
   </soapenv:Body>
</soapenv:Envelope>